blog/_posts/2013-10/2013-10-31-python-httplib.html
---
layout: post
keywords: 
description: 
title: python httplib模块 
categories: [python]
tags: [python,module,httplib]
group: archive
icon: code
featured: false
---

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 简介</a></li>
<li><a href="#sec-2">2 类</a>
<ul>
<li><a href="#sec-2-1">2.1 class httplib.HTTPConnection</a></li>
<li><a href="#sec-2-2">2.2 class httplib.HTTPSConnection</a></li>
</ul>
</li>
<li><a href="#sec-3">3 HTTPConnection常用方法</a>
<ul>
<li><a href="#sec-3-1">3.1 HTTPConnection.request(method, url[, body[, headers]])</a></li>
<li><a href="#sec-3-2">3.2 HTTPConnection.getresponse ()</a></li>
<li><a href="#sec-3-3">3.3 HTTPConnection.connect ()</a></li>
<li><a href="#sec-3-4">3.4 HTTPConnection.close ()</a></li>
<li><a href="#sec-3-5">3.5 HTTPConnection.set<sub>debuglevel</sub> ( level )</a></li>
</ul>
</li>
<li><a href="#sec-4">4 HTTPResponse对象的常用方法</a>
<ul>
<li><a href="#sec-4-1">4.1 HTTPResponse.read([amt])</a></li>
<li><a href="#sec-4-2">4.2 HTTPResponse.getheader(name[, default])</a></li>
<li><a href="#sec-4-3">4.3 HTTPResponse.getheaders()</a></li>
<li><a href="#sec-4-4">4.4 HTTPResponse.msg</a></li>
<li><a href="#sec-4-5">4.5 HTTPResponse.version</a></li>
<li><a href="#sec-4-6">4.6 HTTPResponse.status</a></li>
<li><a href="#sec-4-7">4.7 HTTPResponse.reason</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">简介</h2>
<div class="outline-text-2" id="text-1">

<p>httplib 是 python中http 协议的客户端实现，可以使用该模块来与 HTTP 服务器进行交互。以下是一个非常简单的例子，使用httplib获取google首页的html：
</p>


<pre class="src src-python"><span style="color: #1c86ee;">import</span> httplib
<span style="color: #2e8b57;">conn</span> = httplib.HTTPConnection(<span style="color: #8b7355;">"www.google.cn"</span>)
conn.request(<span style="color: #8b7355;">'get'</span>, <span style="color: #8b7355;">'/'</span>)
<span style="color: #1c86ee;">print</span> conn.getresponse().read()
conn.close()
</pre>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">类</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">class httplib.HTTPConnection</h3>
<div class="outline-text-3" id="text-2-1">

<dl>
<dt>说明</dt><dd>该类用于创建一个http类型的请求链接
</dd>
<dt>原型</dt><dd>
</dd>
</dl>

<p>HTTPConnection(host[, port[, strict[, timeout[, source<sub>address]]]]</sub>)
</p><ul>
<li>host: 请求的服务器host
</li>
<li>port: 服务器web服务端口,如果未指定，而host形如”www.baidu.com:1443″,会提取其中的端口号。否则会使用默认的80端口。
</li>
<li>strict: 表示在无法解析服务器返回的状态行时(status line) (比较典型的状态行如： HTTP/1.0 200 OK)，是否抛BadStatusLine异常
</li>
<li>timeout: 单次请求的超时时间，没有时默认使用httplib模块内的全局的超时时间
</li>
<li>source<sub>address</sub>
</li>
</ul>

<p>返回一个HTTPConnection对象
</p></div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2">class httplib.HTTPSConnection</h3>
<div class="outline-text-3" id="text-2-2">

<dl>
<dt>说明</dt><dd>该类用于创建一个https类型的请求链接.是HTTPSConnection的子类，应用了SSL。默认端口443.
</dd>
<dt>原型</dt><dd>
</dd>
</dl>

<p>HTTPSConnection(host[, port[, key<sub>file[</sub>, cert<sub>file[</sub>, strict[, timeout]]]]])
</p><ul>
<li>key<sub>file</sub>: 一个包含PEM格式的私钥文件
</li>
<li>cert<sub>file</sub>: 一个包含PEM格式的认证文件
</li>
<li>other：其它同http参数
</li>
</ul>

<p>返回一个HTTPSConnection对象
</p><dl>
<dt>注意</dt><dd>
</dd>
</dl>

<p>要创建https链接，必须要保证底层的socket模块是支持ssl的编译模式，即编译时ssl选项的开关是开着的
</p></div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">HTTPConnection常用方法</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1">HTTPConnection.request(method, url[, body[, headers]])</h3>
<div class="outline-text-3" id="text-3-1">

<dl>
<dt>说明</dt><dd>
</dd>
</dl>

<p>发送一个请求
</p><ul>
<li>method: 请求的方式，如’GET’,'POST’,'HEAD’,'PUT’,'DELETE’等
</li>
<li>url: 请求的网页路径。如：’/index.html’
</li>
<li>body: 表示提交到服务器的数据，必须是字符串（如果method 是”post” ，则可以把body 理解为html 表单中的数据）
</li>
<li>headers: 请求的http头
</li>
</ul>

</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2">HTTPConnection.getresponse ()</h3>
<div class="outline-text-3" id="text-3-2">

<p>获取Http 响应。返回的对象是HTTPResponse 的实例，关于HTTPResponse 在下面 会讲解。
</p></div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3">HTTPConnection.connect ()</h3>
<div class="outline-text-3" id="text-3-3">

<p>连接到Http 服务器。
</p></div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4">HTTPConnection.close ()</h3>
<div class="outline-text-3" id="text-3-4">

<p>关闭与服务器的连接。
</p></div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5">HTTPConnection.set<sub>debuglevel</sub> ( level )</h3>
<div class="outline-text-3" id="text-3-5">

<p>设置调试级别。参数level 的默认值为0 ，表示不输出任何调试信息。
</p></div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">HTTPResponse对象的常用方法</h2>
<div class="outline-text-2" id="text-4">

<p>HTTPResponse表示服务器对客户端请求的响应。往往通过调用HTTPConnection.getresponse()来创建，它有如下方法和属性：
</p>
</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1">HTTPResponse.read([amt])</h3>
<div class="outline-text-3" id="text-4-1">

<p>获取响应的消息体。如果请求的是一个普通的网页，那么该方法返回的是页面的html。可选参数amt表示从响应流中读取指定字节的数据，默认为空，读取全部数据
</p></div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2">HTTPResponse.getheader(name[, default])</h3>
<div class="outline-text-3" id="text-4-2">

<p>获取响应头。Name表示头域(header field)名，可选参数default在头域名不存在的情况下作为默认值返回。
</p></div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3">HTTPResponse.getheaders()</h3>
<div class="outline-text-3" id="text-4-3">

<p>以列表的形式[(header,value),(header1,value1)&hellip;]返回所有的头信息。
</p></div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4">HTTPResponse.msg</h3>
<div class="outline-text-3" id="text-4-4">

<p>获取所有的响应头信息。
</p></div>

</div>

<div id="outline-container-4-5" class="outline-3">
<h3 id="sec-4-5">HTTPResponse.version</h3>
<div class="outline-text-3" id="text-4-5">

<p>取服务器所使用的http协议版本。11表示http/1.1；10表示http/1.0。
</p></div>

</div>

<div id="outline-container-4-6" class="outline-3">
<h3 id="sec-4-6">HTTPResponse.status</h3>
<div class="outline-text-3" id="text-4-6">

<p>获取响应的状态码。如：200表示请求成功。404表示NOT FOUND
</p></div>

</div>

<div id="outline-container-4-7" class="outline-3">
<h3 id="sec-4-7">HTTPResponse.reason</h3>
<div class="outline-text-3" id="text-4-7">

<p>回服务器处理请求的结果说明。一般为”OK”
</p></div>
</div>
</div>
